# m.kandilarov@gmail.com
# Ще има FB група, там ще качваме материали за всяко упражнение, там ще има и оценки
# 1. Структори от данни
#  1.1 масиви, таблици, матрици
# 2. Едномерен анализ
# 3. Графики
# 4. Многомерен анализ
# 5. Разпределения
# 6. Тестове и хипотези
# 7. Линейни модели - носи най-много точки

#. Инсталираме Rstudio

# 1. Инсталиране на пакети
# install.packages()

# 2. Кои пакети са инсталирани
# installed.packages()

# 2.1 Да ги искараме като списък
# row.names(installed.packages())

# 3. Зареждане на пакет
# library("UsingR")
# require("UsingR")
# Взаимно заменяеми са

# 4. ?mean | ?lm | help("lm") (? и име на функцията)
# Дава ни информация за дадената функция

# 5. Знаем идеята за подхода, но незнаем функцията, само за инсталирани пакети
# Използваме search - ?? | help.search("linear")
# ??linear
# 
# 6. Присвояване на стойности на променливи
# Има три начина
# x = 5
# x <- 5
# 5 -> x

# 7. Вектори 
# Използва се c()
# vl <- c()
# v1 <- c(1,2,3,4,5,6,7)
# v2 <- c("a", "b", "c")
# v3 <- c(F, T, F, T, F) F - FALSE T - TRUE
# [1] показва индекса на първия елемент
# Стартираме с индекс 1 в R
# Достъпване на елементи става по същия начин v1[1]
# Дължина на вектора length(v1)
# 7.1 ДОбавяне на елементи
# в края на вектора - v1 <- c(v1, 52352352352)
# отпред на вектора - v1 <- c(215215, v1)
# Всеки път при добавяне на елементи се създава нов вектор
# 7. Обединяване на вектори
# v4 <- c(v1, v2)
# Ако обединим стрингов с числов ще се получи стрингов

# 8. Проверка на структурата на елемент
# str(v1) - num [1:6] 1 2 3 4 5 6 Числов вектор с 6 елемента

# 9. Проверка на типа на елемента
# class(v1) - "numeric"

# 10. Създаване на дати
# as.Date("2025-01-07")
# as.Date("2025T01T07", format = "%YT%mT%d")
# as.Date(1247789, origin = "1900-01-01")
# as.Date(c("Дати")) - вектор от дати







