# m.kandilarov@gmail.com
# Ще има FB група, там ще качваме материали за всяко упражнение, там ще има и оценки
# 1. Структори от данни
#  1.1 масиви, таблици, матрици
# 2. Едномерен анализ
# 3. Графики
# 4. Многомерен анализ
# 5. Разпределения
# 6. Тестове и хипотези
# 7. Линейни модели - носи най-много точки

#. Инсталираме Rstudio

# 1. Инсталиране на пакети
# install.packages()

# 2. Кои пакети са инсталирани
# installed.packages()

# 2.1 Да ги искараме като списък
# row.names(installed.packages())

# 3. Зареждане на пакет
# library("UsingR")
# require("UsingR")
# Взаимно заменяеми са

# 4. ?mean | ?lm | help("lm") (? и име на функцията)
# Дава ни информация за дадената функция

# 5. Знаем идеята за подхода, но незнаем функцията, само за инсталирани пакети
# Използваме search - ?? | help.search("linear")
# ??linear
# 
# 6. Присвояване на стойности на променливи
# Има три начина
# x = 5
# x <- 5
# 5 -> x

# 7. Вектори 
# Използва се c()
# vl <- c()
# v1 <- c(1,2,3,4,5,6,7)
# v2 <- c("a", "b", "c")
# v3 <- c(F, T, F, T, F) F - FALSE T - TRUE
# [1] показва индекса на първия елемент
# Стартираме с индекс 1 в R
# Достъпване на елементи става по същия начин v1[1]
# Дължина на вектора length(v1)
# 7.1 ДОбавяне на елементи
# в края на вектора - v1 <- c(v1, 52352352352)
# отпред на вектора - v1 <- c(215215, v1)
# Всеки път при добавяне на елементи се създава нов вектор
# 7. Обединяване на вектори 
# v4 <- c(v1, v2)
# Ако обединим стрингов с числов ще се получи стрингов

# 8. Проверка на структурата на елемент
# str(v1) - num [1:6] 1 2 3 4 5 6 Числов вектор с 6 елемента

# 9. Проверка на типа на елемента
# class(v1) - "numeric"

# 10. Създаване на дати
# as.Date("2025-01-07")
# as.Date("2025T01T07", format = "%YT%mT%d")
# as.Date(1247789, origin = "1900-01-01")
# as.Date(c("Дати")) - вектор от дати


# 11. Числово кастване
# as.numeric(v3) -> превръща датите в дни, ако кастнем char, ще искара NA

# 12. Кастване в character
# as.character(v1)

# 13. Кастване в булеви 
# as.logical(c(532525, 32523523, -315135, 0, 0, 0)
# Връща единици на всичко различно от нула

# -------------------------------------------------------
# 14. Работа с вектори
# Векторите започват от индекс 1
# v1[7]
# 14.1 Вземане на последния елемент - v1[length(v1)]
# 14.2 Може да вземем определен подвектор на даденияя вектор
#   v1[c(3,4,5,6)] -> 3ти 4ти 5ти 6ти елемент
# 14.3 Може да направим вектор с едни и същи елементи
#   v1[c(3,3,3,3,3,3)]
#   Еквивалентно: v1[rep(3,7)]
# 14.4 Поредни числа в редица
#   1:8
#   8:1
# 14.5 Част от вектор в редица
#   v1[6:9]
# 14.6 seq(from = 1, to = 10, by = 2) - Правене на редица от числа
# 14.7 По сложен начин за вземане на елементи
#   v1[c(3,6, 1:4)]
# 14.8 Премахване на елементи от вектор
#   Не променя оригиналния вектор
#   v1[-c(15:20)]
#   Ако искаме да променим оригиналния вектор v1 <- v1[-c(15:20)]
# 14.9 Добавяне на число към всеки елемент на вектора
    # v1 + 3
    # 3 * v1
# 14.10 Умножение на два вектора с равна дължина
#   v1*v2 (1вия елемент на 1вия * 1вия елемент на 2рия)
# 14.11 Промяна на елемент в вектор
#   v1[6] <- 22222
#   v1[c(3,6,9)] <- 2222
# 14.12 Няма Error когато достъпим несъществуващ индекс, а връща NA, Ако
# добавим елемент на далечна позиция, ще запълни с NA и ще промени дължината

# 15. Функции
# f1 <- function(){return(10)}
# func1 <- function(a,b,c) {return(a+b+c)}
# func1(a = 10, b = 20, c = 10)
# return може да се skip-не

# 16. if statement
#   if (missing(a)) {a <- 14}

# 17. If-else условия
# func2 <- function(a) {if(a == T) return(T) else return(F)}
# if() {
# 
# } else if() {
#   
# } else {
#   
# }

# 18. Цикли
#   for(....)
#   for(i in v1) - идеята на forEach
#   for(i in v7) {print(i)}
# 18.1 Обхождане по индекс
#   for(i in 1:length(v7)) - идеята е че създава нов вектор с индексите
#     {print(v7[i])}
#   for(i in length(v7):1)
#     {print(v7[i])}
#   for(i in seq(from = 1, to = length(v7), by = 1))
# continue = next - продължаваме със следващата итерация

# 19. While
#   while(counter < 5) {}

# 20, do-while - Ще повтаря докато не му кажем да спре
#   repeat { .... 
#       if(...) 
#           break
# }

# 21 v7 <- letters[1:5]
#  v7 <- LETTERS[1:5]
