# # 1. Матрица
# m1 <- matrix(data = 1:12, nrow = 4, ncol = 3)
# m1 <- matrix(data = 1:12, nrow = 4)
# m1 <- matrix(data = 1:12, ncol = 1)
# 
# m1 <- matrix(data = 1:12) - Ще напражи матрицата в една колона
# 
# matrix(1:12, nrow = 8) - Лоопва числата и ги записва от начало, ще получим и warning
# matrix(1:12, nrow = 24) - Няма да даде warning, защото е кратно на 12
#
# m1 <- matrix(data = 1:12, nrow = 4, ncol = 3, byrow = TRUE) - Ще излезе матрицата по редове, по default е false, 
# и ще е по колони
#
# 2. Как да направим размера и?
# dim(m3) - Връща размера на матрицата - (#редовете, #колоните)
#     dim(m3)[1] - редовете, same с колоните
#     nrow(m3) - връща редовете (ncol)
# 
# 3. Как се работи с матрица
# m3[ред][колона] - m3[4][3] -> 4ти ред 3та колона
# При матриците ако излезем извън нея (нереален индекс) ще получим грешка
# 3.1 Викане на редове m3[4,] -> връща масив
# 4.2 Викане на колони m3[, 4]
# 4.3 Вземане на подматрица
#   m3[c(4, 4, 6), c(2, 3)] -> дефакто създаваме нова матрица
# 4.4 Добавяне на числа
#   M3 + 3 => Към всеки елемент на матрицата ще сме добавили числото 3
#   M3 *3 -> same shit
# 4.5 Умножение на две матрици
#   m4 <- matrix(1:8, nrow = 4, ncol = 2)
# - Трябва броя на колоните на първата матрица да съвпада с броя на редовете на втората матрица
#     m4 <- M3 %*% M4
#     
# Бел: Като сложим точка и запетайка може да продължим на същия ред да записваме командите
# 4.6 Махане на елементи от матрицата - НЕ
# 4.7 Махане на редове
#    M3[-4, ]
# 4.8 Махане на колони
#   M4[, -3]
#   
# 4,9 Функции свързани с матрицата
#   4.9.1 Обхождане на елементите в матрицата
#     for(index in 1:nrow(M3)) {
#       print(sum(M3[index, ]))
#     }
#   
#     4.9.1.1 For е бавна, за това се използва следното:
#         apply(X = M3, MARGIN = 1, FUN = sum)
#           MARGIN = 1 - редове
#           MARGIN = 2 - колони
#           
#         function(x) -> ред от матрицата
#           
#   4.9.2 Промяна на елемент от колоните
#     M3[7, 3] <- -9999999999999
#     
#   4.9.3 Смяна на целия ред
#     M3[7, ] <- -99999999
#   
#   4.9.4 Промяна ред с някаква функция
#     M3[7, ] <- c(1:2)^ 2
#     
# 5. Data Frame
# - Лист от вектори
# - Имаме някакви вектори
#   5.1 Създаване на data frame
#     cars <- data.frame(as.Date(date),
#                        fuel_type, car_brand, turbo_aspiration, horsepower)
# - as.Date -> превръща число / стринг в дата / Масив от дати
#
# - Прилича малко на csv file
#     
#   5.2 Ако искаме да сменим името на колоната 
#     cars <- data.frame(date = as.Date(date),
#                        fuel_type, car_brand, turbo_aspiration, horsepower)
#     )
# 
#   5.3 names(cars) -> Връща вектор от виски заглавия на колоните
#     names(cars) <- c("A1", "A1", "A1", "A1", "A1")
#     names(cars)[1] <- "date"
#     
#     5.4 head(cars) -> Първите 6 реда по default
#       head(cars, n = 2)
#       
#     5.5 tail(cars) -> обратното
#     
#     5.6 ls() -> всички елементи които сме заредили (променливите)
#     5.8 rm(list = c(...)) -> премахване на заредени елементи, променливи
#     
#     5.9 str(cars) -> Показва повече информация за data frame
#   
#     5.10 Достъпване на data от data frame
#       cars[1, ] -> Първи ред и всички колони
#       cars[, 2] -> Втора колона и всички редове
#       Бел: Може и с имената на колоната и реда
#         cars["1", ]
#         cars[, "date"]
#         cars$date -> използваме $ с име на колона
#       
#       cars[5, c(2, 3)] -> на 5ти ред вземи 2 и 3 колона
#       
#     5.11 Достъпване имената на редовете 
#       row.names(cars)
#       
#       row.names(cars) <- paste("car", row.names(cars))
#       row.names(cars) <- paste("car", row.names(cars), sep = "R")
#       
#       Да върнем обратно имената
#       
#       row.names(cars) <- c(1:nrow(cars))
#       
#       
# Важно: При конкатениране на стрингове използваме paste("", something)
#   - Defailt сепаратор е " " 
#   - sep = 
# 
#     5.12 cars[which(cars$fuel-type == "diessel"), ] -> филтър, where в SQL
#       which(cars$fuel-type == "diessel" & cars[, "horsepower"] > 150))
#       
# 
# Важно: Негация става по следния начин - !, -
# Важно: Да не забравяма запетайката накрая
# Важно: Which връща вектор
# Важно: & и | или
# Важно: %in% c("p", "m") -> Като in в Python


    5.12 Конкатениране на матрици или date frame
  
# Важно: rm(list = ls()) зачиства всичко
    
    # rbind() -> Броя от колоните на едната трябва да е равен на броя на колоните на втората (обединява редовете)
    #   - Залепва ги една върху друга
    # 
    # cbind() - Броя от редовете на едната трябва да е равен на броя на редовете на втората (обединява колоните)
    # - Залепва ги една до друга
    
# транспониране на матрици t(M3)
    





    
  
